Tekla Open API Reference for Tekla Structures 2025
ModelViewEnumerator.CurrentViewId Property
 Gets the current view identifier.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int CurrentViewId { get; }
Public ReadOnly Property CurrentViewId As Integer
	Get
Property Value
Type: Int32
See Also
Reference
ModelViewEnumerator Class
Tekla.Structures.Model.UI Namespace